{
  "crisis on infinite earths": "A 1985 crossover event published by DC Comics. The series focuses on the Anti-Monitor's attempts to destroy the DC Multiverse and the efforts of the heroes to stop him, resulting in the merging of the multiverse into a single Earth.",
  "infinite crisis": "A 2005 storyline published by DC Comics. It serves as a sequel to the 1985 limited series Crisis on Infinite Earths. The plot revolves around the return of Alexander Luthor Jr. and Superboy-Prime who seek to recreate the multiverse.",
  "civil war": "A 2006 Marvel Comics crossover storyline built around a superhero registration act. Two factions emerge: one led by Iron Man supporting registration, and the other led by Captain America opposing it.",
  "the infinity gauntlet": "A six-issue comic book limited series published by Marvel Comics in 1991. The series features the Mad Titan Thanos, who uses the six Infinity Gems to erase half of all life in the universe.",
  "secret wars": "A twelve-issue comic book limited series published by Marvel Comics in 1984. A cosmic entity called the Beyonder transports various superheroes and supervillains to a planet called Battleworld to fight.",
  "flashpoint": "A 2011 crossover story arc published by DC Comics. The Flash wakes up in an altered timeline where his mother is alive, Superman does not exist, and Aquaman and Wonder Woman are at war.",
  "house of m": "A 2005 storyline published by Marvel Comics. The Scarlet Witch suffers a mental breakdown and alters reality to create a world where mutants are the dominant species and Magneto is their ruler.",
  "blackest night": "A 2009 crossover storyline published by DC Comics. It involves Nekron, a personified force of death who reanimates deceased superheroes and seeks to eliminate all life and emotion from the universe.",
  "zero hour": "A 1994 comic book crossover storyline published by DC Comics. Hal Jordan, now the villain Parallax, attempts to destroy and recreate the DC Universe timeline to fix past mistakes.",
  "annihilation": "A 2006 crossover storyline published by Marvel Comics, highlighting various outer space-related characters uniting against Annihilus and his Annihilation Wave.",
  "knightfall": "A 1993 Batman story arc published by DC Comics. It depicts Bane breaking Batman's back, leading to Azrael taking over the mantle of the Bat.",
  "age of apocalypse": "A 1995 comic book crossover storyline published by Marvel Comics. An accidental time travel incident leads to the death of Charles Xavier, creating a timeline where Apocalypse has conquered North America.",
  "armageddon 2001": "A 1991 crossover event storyline published by DC Comics. The story begins in the year 2030, where Monarch has conquered Earth after slaughtering nearly all superheroes. To stop this fate, scientist Matthew Ryder transforms into Waverider, gaining temporal powers that allow him to travel back in time. His mission is to discover which present-day hero will eventually become Monarch and prevent that transformation."

}